Tekla Open API Reference for Tekla Structures 2025
SymbolElement Class
 The SymbolElement class represents a symbol in the Tekla Structures symbol library.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 Tekla.Structures.Drawing.SymbolElement
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SymbolElement : ElementBase
<SerializableAttribute>
Public NotInheritable Class SymbolElement
	Inherits ElementBase
The SymbolElement type exposes the following members.
Constructors
Name | Description
SymbolElement()
 Creates a new symbol element instance with the default symbol.
SymbolElement(SymbolInfo)
 Creates a new symbol element instance with the given symbol.
SymbolElement(SymbolInfo, DrawingColors, Double)
 Creates a new symbol element instance with the given symbol, color and height.
SymbolElement(SymbolInfo, TeklaDrawingColor, Double)
 Creates a new symbol element instance with the given symbol, the RGB color and height.
Top
Properties
Name | Description
Color
 This property is the symbol color.
Height
 The symbol height (mm).
Symbol
 The symbol.
TrueColor
 The true color (rgb enabled) of the symbol.
Top
Methods
Name | Description
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace